import React from "react";
import { useContext } from "react";
import { DataContext } from "../../../App";

//books
import booktest from "../../../images/book_test.jpg";
import bookSet1_1 from "../../../images/setBook1_1.jpg";
import bookSet1_2 from "../../../images/setBook1_2.jpg";
import bookSet1_3 from "../../../images/setBook1_3.jpg";
import bookSet2 from "../../../images/setBook2.jpg";

import book1 from "../../../images/recommentBook/book1.png"
import book2 from "../../../images/recommentBook/book2.png"
import book3 from "../../../images/recommentBook/book3.png"
import book4 from "../../../images/recommentBook/book4.png"
import book5 from "../../../images/recommentBook/book5.png"
import book6 from "../../../images/recommentBook/book6.png"
import book7 from "../../../images/recommentBook/book7.png"
import book8 from "../../../images/recommentBook/book8.png"
import book9 from "../../../images/recommentBook/book9.png"

export default function useBook() {
  const { userName } = useContext(DataContext);

  const recommendedBooks = [
    {
      nameBook: "ใช้คลื่นพลังบวกดึงดูดพลังสุข",
      author: "Vex King (เว็กซ์ คิงส์)",
      detailBook: `เล่มนี้จะช่วยให้${userName}เข้าใจถึงวิธีการใช้พลังบวกในการดึงดูดความสุขและความสำเร็จในชีวิต 
        โดยผู้เขียนแบ่งปันประสบการณ์และแนวคิดเกี่ยวกับการเปลี่ยนแปลงทางจิตใจเพื่อเพิ่มความสุขให้กับชีวิตประจำวัน 
        เป็นเล่มที่เหมาะสำหรับผู้ที่ต้องการพัฒนาทัศนคติและสร้างชีวิตที่ดีกว่าเดิม`,
        imgBook: book1
    },
    {
      nameBook: "ปล่อยวางบ้างก็ได้นะ",
      author: "Alessandra Olanow",
      detailBook: `เล่มนี้จะช่วยให้${userName}เรียนรู้ที่จะปล่อยวางและให้ตัวเองมีพื้นที่ในชีวิตมากขึ้น 
        หนังสือเล่มนี้เป็นเล่มที่มีภาพวาดและข้อความที่เรียบง่ายแต่ลึกซึ้ง ที่ช่วยเตือนใจให้เรามองชีวิตในมุมที่ง่ายขึ้น 
        เป็นหนังสือที่เหมาะสำหรับคนที่ต้องการปล่อยวางและพักผ่อนใจ`,
        imgBook: book3
    },
    {
      nameBook: "Manifest: 7 ขั้นตอนสู่ทุกสิ่งที่ปรารถนา",
      author: "Roxie Nafousi",
      detailBook: `สำหรับ${userName}ที่กำลังมองหาวิธีการเปลี่ยนแปลงชีวิตและสร้างสิ่งที่ปรารถนา หนังสือเล่มนี้จะแนะนำวิธีการ 
        และเทคนิคในแต่ละขั้นตอน เพื่อช่วยให้ผู้อ่านสามารถดึงดูดสิ่งดีๆ เข้ามาในชีวิตและทำให้ความฝันกลายเป็นจริง`,
        imgBook: book2
    },
    {
      nameBook: "101 Essays That Will Change The Way You Think",
      author: "Brianna Wiest",
      detailBook: `หนังสือเล่มนี้รวบรวมบทความที่ลึกซึ้งและให้แง่คิดเกี่ยวกับการมองชีวิตในมุมที่ต่างออกไป 
        สำหรับ${userName}ที่ต้องการพัฒนาความคิดและปรับเปลี่ยนมุมมองต่อชีวิต หนังสือเล่มนี้จะเป็นแหล่งแรงบันดาลใจที่ดี 
        ซึ่งจะช่วยให้คิดและตัดสินใจในเรื่องต่างๆ อย่างมีสติและมั่นใจมากขึ้น`,
        imgBook: book4
    },
    {
      nameBook: "ร้านไม่สะดวกซื้อของคุณทกโก",
      author: "คิมโฮย็อน",
      detailBook: `หนังสือเล่มนี้เล่าเรื่องราวของร้านสะดวกซื้อในเกาหลีใต้ ที่มีมุมมองแปลกใหม่และเต็มไปด้วยบทเรียนชีวิต 
        เป็นเล่มที่เหมาะกับ${userName}ที่ชอบการเรียนรู้ผ่านเรื่องราวและสนใจการพัฒนาตนเองผ่านมุมมองที่ต่างออกไป`,
        imgBook: book5
    },
    {
      nameBook: "ชีวิตเรามีแค่สี่พันสัปดาห์",
      author: "Oliver Burkeman",
      detailBook: `หนังสือเล่มนี้เตือนให้${userName}มองเห็นคุณค่าของเวลาและใช้ชีวิตให้คุ้มค่า 
        โดยเฉพาะเมื่อเวลาของเรามีจำกัด การตั้งเป้าหมายในชีวิตและการใช้เวลาให้เกิดประโยชน์สูงสุด 
        เป็นเนื้อหาที่ช่วยกระตุ้นให้คนอ่านพิจารณาถึงการจัดลำดับความสำคัญในชีวิต`,
        imgBook: book6
    },
    {
      nameBook: "สัญญานะว่าจะยิ้มให้กับตัวเอง",
      author: "Whenimfeeeling",
      detailBook: `หนังสือเล่มนี้เหมาะสำหรับ${userName}ที่กำลังมองหาวิธีสร้างกำลังใจให้กับตัวเอง 
        และต้องการการยอมรับตัวเองในวันที่รู้สึกท้อแท้ เป็นหนังสือที่อ่อนโยนและมีคำแนะนำที่ช่วยให้ผู้อ่านมีกำลังใจ 
        และมองชีวิตในแง่ที่ดีขึ้น`,
        imgBook: bookSet2
    },
    {
      nameBook: "เลิกเป็นคนดี แล้วจะมีความสุข",
      author: "โกะโด โทคิโอะ (Tokio Godo)",
      detailBook: `หนังสือเล่มนี้ช่วยให้${userName}เข้าใจว่าการเป็นคนดีเกินไปอาจทำให้เราสูญเสียความสุขและพลังงาน 
        และแนะนำวิธีการที่จะทำให้เรามีความสุขได้โดยไม่จำเป็นต้องพยายามเป็นที่พอใจของทุกคน 
        เป็นหนังสือที่ช่วยเสริมสร้างความมั่นใจและการเคารพตัวเองในแบบที่แท้จริง`,
        imgBook: book7
    },
    {
      nameBook: "กล้าที่จะถูกเกลียด",
      author: "คิชิมิ อิชิโร, โคะกะ ฟุมิทะเกะ",
      detailBook: `สำหรับ${userName}ที่ต้องการเข้าใจถึงแนวคิดในการเผชิญกับความกดดันทางสังคม 
        และเรียนรู้ที่จะยอมรับตนเองในแบบที่ตนเป็น หนังสือเล่มนี้จะสอนให้เราเข้าใจว่าการใช้ชีวิตตามความเชื่อของเราเอง 
        และไม่หวาดกลัวการถูกตัดสินหรือถูกเกลียด`,
        imgBook: book8
    },
    {
      nameBook: "The Secret",
      author: "รอนดา เบิร์น (Rhonda Byrne)",
      detailBook: `หนังสือเล่มนี้เป็นการแนะนำหลักการของ "กฎแห่งแรงดึงดูด" 
        ซึ่งจะช่วยให้${userName}เห็นถึงพลังของความคิดบวกในการดึงดูดสิ่งดีๆ เข้ามาในชีวิต 
        เป็นเล่มที่เหมาะสำหรับผู้ที่ต้องการเปลี่ยนแปลงชีวิตด้วยการเปลี่ยนแปลงความคิด`,
        imgBook: book9
    },
  ];
  

  const books1 = [
    {
      nameBook: "The Alchemist",
      author: "Paulo Coelho",
      detailBook: `เล่มนี้เป็นเรื่องราวของการตามหาความฝันและความหมายของชีวิต โดยผู้เขียนเล่าเรื่องของซานติอาโก 
        คนเลี้ยงแกะที่ออกเดินทางค้นหาสมบัติในดินแดนที่ห่างไกล หนังสือเล่มนี้เหมาะสำหรับ${userName} 
        เพราะเน้นย้ำถึงการเชื่อในความฝันของตนเองและการยืนหยัดต่อสู้แม้เส้นทางจะยากลำบาก`,
      imgBook: bookSet1_1,
    },
    {
      nameBook: "Atomic Habits",
      author: "James Clear",
      detailBook: `หนังสือเล่มนี้อธิบายถึงวิธีการเปลี่ยนนิสัยเล็ก ๆ เพื่อสร้างความสำเร็จใหญ่ 
        เน้นที่การปรับปรุงทีละเล็กทีละน้อยที่สามารถนำไปสู่การเปลี่ยนแปลงที่ยิ่งใหญ่ 
        เล่มนี้จะช่วยให้${userName}มองเห็นวิธีการปรับเปลี่ยนและพัฒนาตนเองในระยะยาว 
        ซึ่งจะเป็นประโยชน์ในการทำตามความฝันของ${userName}เอง`,
      imgBook: bookSet1_2,
    },
    {
      nameBook: "Man's Search for Meaning",
      author: "Viktor E. Frankl",
      detailBook: `เล่มนี้เป็นผลงานที่มีความลึกซึ้งและทรงพลัง 
        เนื้อหาเกี่ยวกับประสบการณ์ของผู้เขียนที่รอดชีวิตจากค่ายกักกันในช่วงสงครามโลกครั้งที่ 2 
        และความคิดเกี่ยวกับการค้นหาความหมายของชีวิต ${userName}จะได้รับแรงบันดาลใจในการต่อสู้กับอุปสรรค
        และค้นหาความหมายของความฝันที่${userName}เชื่อมั่น`,
      imgBook: bookSet1_3,
    },
  ];
  const books2 = [
    {
      nameBook: "สัญญานะว่าจะยิ้มให้กับตัวเอง",
      author: "Whenimfeeeling",
      detailBook: `สำหรับ${userName}หนังสือเล่มนี้น่าจะเป็นประโยชน์อย่างยิ่ง 
        เพราะเป็นหนังสือที่เหมาะกับคนที่กำลังอยู่ในช่วงเวลาแห่งการคิดทบทวนตัวเองที่กำลังรู้สึกไม่พร้อมที่จะเริ่มต้นใหม่ 
        หรือกำลังหาวิธีในการเสริมสร้างพลังใจให้สามารถก้าวข้ามอุปสรรคต่าง ๆ ไปได้ 
        โดยไม่ต้องเร่งรีบในการตัดสินใจหรือเปลี่ยนแปลงชีวิต หนังสือเล่มนี้อาจช่วยให้${userName}รู้สึกมั่นใจมากขึ้น
        ในการเผชิญกับความท้าทายในชีวิตและหันมามองตัวเองในแง่ที่ดียิ่งขึ้น`,
      imgBook: bookSet2,
    },
    {
      nameBook: "Atomic Habits",
      author: "James Clear",
      detailBook: `เล่มนี้เหมาะกับคนที่ต้องการปรับเปลี่ยนพฤติกรรมหรือพัฒนานิสัยใหม่ 
        แต่ยังไม่พร้อมสำหรับการเปลี่ยนแปลงที่ใหญ่โต "Atomic Habits" 
        ให้คำแนะนำและวิธีการเล็กๆ น้อยๆ ที่สามารถนำไปสู่การเปลี่ยนแปลงที่มีผลในระยะยาว 
        หนังสือเล่มนี้อาจช่วยให้${userName}สร้างพื้นฐานเล็กๆ 
        เพื่อเตรียมตัวสำหรับการก้าวเดินไปข้างหน้าเมื่อคุณพร้อม`,
      imgBook: bookSet1_2,
    },
    {
      nameBook: "Man's Search for Meaning",
      author: "Viktor E. Frankl",
      detailBook: `หนังสือเล่มนี้อธิบายถึงประสบการณ์ที่ผู้เขียนได้ผ่านการอยู่ในค่ายกักกันนาซีและการค้นหาความหมายในชีวิต 
        แม้ว่าจะอยู่ในสถานการณ์ที่ยากลำบาก หนังสือเล่มนี้อาจช่วยให้${userName}ได้พิจารณาและหาความหมายหรือวัตถุประสงค์ในชีวิตของคุณเอง`,
      imgBook: bookSet1_3,
    },
  ];

  return {books1, books2, recommendedBooks};
}
